In [1]:
import numpy as np
import pandas as pd

In [2]:
from google.colab import files
uploaded=files.upload()

Saving titanic.csv to titanic.csv

In [3]:
import io
data=pd.read_csv(io.BytesIO(uploaded['titanic.csv']))
data

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [4]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
data

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [5]:
x = data.drop('Survived',axis='columns')
y = data.Survived

In [6]:
x.Sex = x.Sex.map({'male': 1, 'female': 2})

In [7]:
x.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [8]:
import math
mean_age=x.Age.mean()
mean_age=math.floor(mean_age)
print(mean_age)
x.Age=x.Age.fillna(mean_age)
x.Age

29

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    29.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

### **Data Splitting into train and test**

In [9]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)
x_train

     Pclass  Sex    Age     Fare
431       3    2  29.00  16.1000
853       1    2  16.00  39.4000
875       3    2  15.00   7.2250
799       3    2  30.00  24.1500
860       3    1  41.00  14.1083
..      ...  ...    ...      ...
507       1    1  29.00  26.5500
691       3    2   4.00  13.4167
755       2    1   0.67  14.5000
133       2    2  29.00  26.0000
559       3    2  36.00  17.4000

[712 rows x 4 columns]

### **Model Training**

In [10]:
from sklearn.linear_model import LinearRegression
model=LinearRegression(normalize=True)
model.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=True)

### **Model Accuracy**

In [11]:
model.score(x_test,y_test)

0.3696376505436646